benchmarks/database/results/before/latest-medium/summary.txt
pgbench (17.5 (Homebrew))
transaction type: /Users/reidhewitt/work/xentity/datagov/datagov-harvesting-logic/benchmarks/database/results/before/latest-medium/query.sql
scaling factor: 1
query mode: simple
number of clients: 1
number of threads: 1
maximum number of tries: 1
number of transactions per client: 100
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 7921.249 ms
initial connection time = 33.395 ms
tps = 0.126243 (without initial connection time)